Revit 2026 API

# ApplicationActiveAddInId Property

---

Retrieves the Id of the currently running external application.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AddInId ActiveAddInId { get; }
```
```vb
Public ReadOnly Property ActiveAddInId As AddInId
	Get
```
```cpp
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
```
```fsharp
member ActiveAddInId : AddInId with get
```

#### Property Value

AddInId

The application can be either a UI application, DB application, or an external command. If no addin is active, this property will return . If an event handler is currently being executed, the returned value will be the Id of the application or command in which the event handler was registered.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace